// 0. Напишите программу, которая на вход принимает число и
//    выдаёт его квадрат (число умноженное на само себя).
Console.WriteLine("Write number");
string num = Console.ReadLine()!;
int number = int.Parse(num);
Console.WriteLine(number*number);
